{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "generator", "layers": [{"name": "LR", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "LR"}, "inbound_nodes": []}, {"name": "F_m1", "class_name": "Conv2D", "config": {"name": "F_m1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LR", 0, 0, {}]]]}, {"name": "F_0", "class_name": "Conv2D", "config": {"name": "F_0", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["F_m1", 0, 0, {}]]]}, {"name": "F_1_1", "class_name": "Conv2D", "config": {"name": "F_1_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["F_0", 0, 0, {}]]]}, {"name": "F_1_1_Relu", "class_name": "Activation", "config": {"name": "F_1_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_1_1", 0, 0, {}]]]}, {"name": "RDB_Concat_1_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_1_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["F_0", 0, 0, {}], ["F_1_1_Relu", 0, 0, {}]]]}, {"name": "F_1_2", "class_name": "Conv2D", "config": {"name": "F_1_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_1_1", 0, 0, {}]]]}, {"name": "F_1_2_Relu", "class_name": "Activation", "config": {"name": "F_1_2_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_1_2", 0, 0, {}]]]}, {"name": "RDB_Concat_1_2", "class_name": "Concatenate", "config": {"name": "RDB_Concat_1_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_1_1", 0, 0, {}], ["F_1_2_Relu", 0, 0, {}]]]}, {"name": "F_1_3", "class_name": "Conv2D", "config": {"name": "F_1_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_1_2", 0, 0, {}]]]}, {"name": "F_1_3_Relu", "class_name": "Activation", "config": {"name": "F_1_3_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_1_3", 0, 0, {}]]]}, {"name": "RDB_Concat_1_3", "class_name": "Concatenate", "config": {"name": "RDB_Concat_1_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_1_2", 0, 0, {}], ["F_1_3_Relu", 0, 0, {}]]]}, {"name": "F_1_4", "class_name": "Conv2D", "config": {"name": "F_1_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_1_3", 0, 0, {}]]]}, {"name": "F_1_4_Relu", "class_name": "Activation", "config": {"name": "F_1_4_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_1_4", 0, 0, {}]]]}, {"name": "RDB_Concat_1_4", "class_name": "Concatenate", "config": {"name": "RDB_Concat_1_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_1_3", 0, 0, {}], ["F_1_4_Relu", 0, 0, {}]]]}, {"name": "F_1_5", "class_name": "Conv2D", "config": {"name": "F_1_5", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_1_4", 0, 0, {}]]]}, {"name": "F_1_5_Relu", "class_name": "Activation", "config": {"name": "F_1_5_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_1_5", 0, 0, {}]]]}, {"name": "RDB_Concat_1_5", "class_name": "Concatenate", "config": {"name": "RDB_Concat_1_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_1_4", 0, 0, {}], ["F_1_5_Relu", 0, 0, {}]]]}, {"name": "F_1_6", "class_name": "Conv2D", "config": {"name": "F_1_6", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_1_5", 0, 0, {}]]]}, {"name": "F_1_6_Relu", "class_name": "Activation", "config": {"name": "F_1_6_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_1_6", 0, 0, {}]]]}, {"name": "RDB_Concat_1_6", "class_name": "Concatenate", "config": {"name": "RDB_Concat_1_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_1_5", 0, 0, {}], ["F_1_6_Relu", 0, 0, {}]]]}, {"name": "LFF_1", "class_name": "Conv2D", "config": {"name": "LFF_1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_1_6", 0, 0, {}]]]}, {"name": "LRL_1", "class_name": "Add", "config": {"name": "LRL_1", "trainable": true}, "inbound_nodes": [[["LFF_1", 0, 0, {}], ["F_0", 0, 0, {}]]]}, {"name": "F_2_1", "class_name": "Conv2D", "config": {"name": "F_2_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LRL_1", 0, 0, {}]]]}, {"name": "F_2_1_Relu", "class_name": "Activation", "config": {"name": "F_2_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_2_1", 0, 0, {}]]]}, {"name": "RDB_Concat_2_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_2_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["LRL_1", 0, 0, {}], ["F_2_1_Relu", 0, 0, {}]]]}, {"name": "F_2_2", "class_name": "Conv2D", "config": {"name": "F_2_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_2_1", 0, 0, {}]]]}, {"name": "F_2_2_Relu", "class_name": "Activation", "config": {"name": "F_2_2_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_2_2", 0, 0, {}]]]}, {"name": "RDB_Concat_2_2", "class_name": "Concatenate", "config": {"name": "RDB_Concat_2_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_2_1", 0, 0, {}], ["F_2_2_Relu", 0, 0, {}]]]}, {"name": "F_2_3", "class_name": "Conv2D", "config": {"name": "F_2_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_2_2", 0, 0, {}]]]}, {"name": "F_2_3_Relu", "class_name": "Activation", "config": {"name": "F_2_3_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_2_3", 0, 0, {}]]]}, {"name": "RDB_Concat_2_3", "class_name": "Concatenate", "config": {"name": "RDB_Concat_2_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_2_2", 0, 0, {}], ["F_2_3_Relu", 0, 0, {}]]]}, {"name": "F_2_4", "class_name": "Conv2D", "config": {"name": "F_2_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_2_3", 0, 0, {}]]]}, {"name": "F_2_4_Relu", "class_name": "Activation", "config": {"name": "F_2_4_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_2_4", 0, 0, {}]]]}, {"name": "RDB_Concat_2_4", "class_name": "Concatenate", "config": {"name": "RDB_Concat_2_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_2_3", 0, 0, {}], ["F_2_4_Relu", 0, 0, {}]]]}, {"name": "F_2_5", "class_name": "Conv2D", "config": {"name": "F_2_5", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_2_4", 0, 0, {}]]]}, {"name": "F_2_5_Relu", "class_name": "Activation", "config": {"name": "F_2_5_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_2_5", 0, 0, {}]]]}, {"name": "RDB_Concat_2_5", "class_name": "Concatenate", "config": {"name": "RDB_Concat_2_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_2_4", 0, 0, {}], ["F_2_5_Relu", 0, 0, {}]]]}, {"name": "F_2_6", "class_name": "Conv2D", "config": {"name": "F_2_6", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_2_5", 0, 0, {}]]]}, {"name": "F_2_6_Relu", "class_name": "Activation", "config": {"name": "F_2_6_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_2_6", 0, 0, {}]]]}, {"name": "RDB_Concat_2_6", "class_name": "Concatenate", "config": {"name": "RDB_Concat_2_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_2_5", 0, 0, {}], ["F_2_6_Relu", 0, 0, {}]]]}, {"name": "LFF_2", "class_name": "Conv2D", "config": {"name": "LFF_2", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_2_6", 0, 0, {}]]]}, {"name": "LRL_2", "class_name": "Add", "config": {"name": "LRL_2", "trainable": true}, "inbound_nodes": [[["LFF_2", 0, 0, {}], ["LRL_1", 0, 0, {}]]]}, {"name": "F_3_1", "class_name": "Conv2D", "config": {"name": "F_3_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LRL_2", 0, 0, {}]]]}, {"name": "F_3_1_Relu", "class_name": "Activation", "config": {"name": "F_3_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_3_1", 0, 0, {}]]]}, {"name": "RDB_Concat_3_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_3_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["LRL_2", 0, 0, {}], ["F_3_1_Relu", 0, 0, {}]]]}, {"name": "F_3_2", "class_name": "Conv2D", "config": {"name": "F_3_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_3_1", 0, 0, {}]]]}, {"name": "F_3_2_Relu", "class_name": "Activation", "config": {"name": "F_3_2_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_3_2", 0, 0, {}]]]}, {"name": "RDB_Concat_3_2", "class_name": "Concatenate", "config": {"name": "RDB_Concat_3_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_3_1", 0, 0, {}], ["F_3_2_Relu", 0, 0, {}]]]}, {"name": "F_3_3", "class_name": "Conv2D", "config": {"name": "F_3_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_3_2", 0, 0, {}]]]}, {"name": "F_3_3_Relu", "class_name": "Activation", "config": {"name": "F_3_3_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_3_3", 0, 0, {}]]]}, {"name": "RDB_Concat_3_3", "class_name": "Concatenate", "config": {"name": "RDB_Concat_3_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_3_2", 0, 0, {}], ["F_3_3_Relu", 0, 0, {}]]]}, {"name": "F_3_4", "class_name": "Conv2D", "config": {"name": "F_3_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_3_3", 0, 0, {}]]]}, {"name": "F_3_4_Relu", "class_name": "Activation", "config": {"name": "F_3_4_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_3_4", 0, 0, {}]]]}, {"name": "RDB_Concat_3_4", "class_name": "Concatenate", "config": {"name": "RDB_Concat_3_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_3_3", 0, 0, {}], ["F_3_4_Relu", 0, 0, {}]]]}, {"name": "F_3_5", "class_name": "Conv2D", "config": {"name": "F_3_5", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_3_4", 0, 0, {}]]]}, {"name": "F_3_5_Relu", "class_name": "Activation", "config": {"name": "F_3_5_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_3_5", 0, 0, {}]]]}, {"name": "RDB_Concat_3_5", "class_name": "Concatenate", "config": {"name": "RDB_Concat_3_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_3_4", 0, 0, {}], ["F_3_5_Relu", 0, 0, {}]]]}, {"name": "F_3_6", "class_name": "Conv2D", "config": {"name": "F_3_6", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_3_5", 0, 0, {}]]]}, {"name": "F_3_6_Relu", "class_name": "Activation", "config": {"name": "F_3_6_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_3_6", 0, 0, {}]]]}, {"name": "RDB_Concat_3_6", "class_name": "Concatenate", "config": {"name": "RDB_Concat_3_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_3_5", 0, 0, {}], ["F_3_6_Relu", 0, 0, {}]]]}, {"name": "LFF_3", "class_name": "Conv2D", "config": {"name": "LFF_3", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_3_6", 0, 0, {}]]]}, {"name": "LRL_3", "class_name": "Add", "config": {"name": "LRL_3", "trainable": true}, "inbound_nodes": [[["LFF_3", 0, 0, {}], ["LRL_2", 0, 0, {}]]]}, {"name": "F_4_1", "class_name": "Conv2D", "config": {"name": "F_4_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LRL_3", 0, 0, {}]]]}, {"name": "F_4_1_Relu", "class_name": "Activation", "config": {"name": "F_4_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_4_1", 0, 0, {}]]]}, {"name": "RDB_Concat_4_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_4_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["LRL_3", 0, 0, {}], ["F_4_1_Relu", 0, 0, {}]]]}, {"name": "F_4_2", "class_name": "Conv2D", "config": {"name": "F_4_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_4_1", 0, 0, {}]]]}, {"name": "F_4_2_Relu", "class_name": "Activation", "config": {"name": "F_4_2_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_4_2", 0, 0, {}]]]}, {"name": "RDB_Concat_4_2", "class_name": "Concatenate", "config": {"name": "RDB_Concat_4_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_4_1", 0, 0, {}], ["F_4_2_Relu", 0, 0, {}]]]}, {"name": "F_4_3", "class_name": "Conv2D", "config": {"name": "F_4_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_4_2", 0, 0, {}]]]}, {"name": "F_4_3_Relu", "class_name": "Activation", "config": {"name": "F_4_3_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_4_3", 0, 0, {}]]]}, {"name": "RDB_Concat_4_3", "class_name": "Concatenate", "config": {"name": "RDB_Concat_4_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_4_2", 0, 0, {}], ["F_4_3_Relu", 0, 0, {}]]]}, {"name": "F_4_4", "class_name": "Conv2D", "config": {"name": "F_4_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_4_3", 0, 0, {}]]]}, {"name": "F_4_4_Relu", "class_name": "Activation", "config": {"name": "F_4_4_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_4_4", 0, 0, {}]]]}, {"name": "RDB_Concat_4_4", "class_name": "Concatenate", "config": {"name": "RDB_Concat_4_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_4_3", 0, 0, {}], ["F_4_4_Relu", 0, 0, {}]]]}, {"name": "F_4_5", "class_name": "Conv2D", "config": {"name": "F_4_5", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_4_4", 0, 0, {}]]]}, {"name": "F_4_5_Relu", "class_name": "Activation", "config": {"name": "F_4_5_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_4_5", 0, 0, {}]]]}, {"name": "RDB_Concat_4_5", "class_name": "Concatenate", "config": {"name": "RDB_Concat_4_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_4_4", 0, 0, {}], ["F_4_5_Relu", 0, 0, {}]]]}, {"name": "F_4_6", "class_name": "Conv2D", "config": {"name": "F_4_6", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_4_5", 0, 0, {}]]]}, {"name": "F_4_6_Relu", "class_name": "Activation", "config": {"name": "F_4_6_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_4_6", 0, 0, {}]]]}, {"name": "RDB_Concat_4_6", "class_name": "Concatenate", "config": {"name": "RDB_Concat_4_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_4_5", 0, 0, {}], ["F_4_6_Relu", 0, 0, {}]]]}, {"name": "LFF_4", "class_name": "Conv2D", "config": {"name": "LFF_4", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_4_6", 0, 0, {}]]]}, {"name": "LRL_4", "class_name": "Add", "config": {"name": "LRL_4", "trainable": true}, "inbound_nodes": [[["LFF_4", 0, 0, {}], ["LRL_3", 0, 0, {}]]]}, {"name": "F_5_1", "class_name": "Conv2D", "config": {"name": "F_5_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LRL_4", 0, 0, {}]]]}, {"name": "F_5_1_Relu", "class_name": "Activation", "config": {"name": "F_5_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_5_1", 0, 0, {}]]]}, {"name": "RDB_Concat_5_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_5_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["LRL_4", 0, 0, {}], ["F_5_1_Relu", 0, 0, {}]]]}, {"name": "F_5_2", "class_name": "Conv2D", "config": {"name": "F_5_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_5_1", 0, 0, {}]]]}, {"name": "F_5_2_Relu", "class_name": "Activation", "config": {"name": "F_5_2_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_5_2", 0, 0, {}]]]}, {"name": "RDB_Concat_5_2", "class_name": "Concatenate", "config": {"name": "RDB_Concat_5_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_5_1", 0, 0, {}], ["F_5_2_Relu", 0, 0, {}]]]}, {"name": "F_5_3", "class_name": "Conv2D", "config": {"name": "F_5_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_5_2", 0, 0, {}]]]}, {"name": "F_5_3_Relu", "class_name": "Activation", "config": {"name": "F_5_3_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_5_3", 0, 0, {}]]]}, {"name": "RDB_Concat_5_3", "class_name": "Concatenate", "config": {"name": "RDB_Concat_5_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_5_2", 0, 0, {}], ["F_5_3_Relu", 0, 0, {}]]]}, {"name": "F_5_4", "class_name": "Conv2D", "config": {"name": "F_5_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_5_3", 0, 0, {}]]]}, {"name": "F_5_4_Relu", "class_name": "Activation", "config": {"name": "F_5_4_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_5_4", 0, 0, {}]]]}, {"name": "RDB_Concat_5_4", "class_name": "Concatenate", "config": {"name": "RDB_Concat_5_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_5_3", 0, 0, {}], ["F_5_4_Relu", 0, 0, {}]]]}, {"name": "F_5_5", "class_name": "Conv2D", "config": {"name": "F_5_5", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_5_4", 0, 0, {}]]]}, {"name": "F_5_5_Relu", "class_name": "Activation", "config": {"name": "F_5_5_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_5_5", 0, 0, {}]]]}, {"name": "RDB_Concat_5_5", "class_name": "Concatenate", "config": {"name": "RDB_Concat_5_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_5_4", 0, 0, {}], ["F_5_5_Relu", 0, 0, {}]]]}, {"name": "F_5_6", "class_name": "Conv2D", "config": {"name": "F_5_6", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_5_5", 0, 0, {}]]]}, {"name": "F_5_6_Relu", "class_name": "Activation", "config": {"name": "F_5_6_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_5_6", 0, 0, {}]]]}, {"name": "RDB_Concat_5_6", "class_name": "Concatenate", "config": {"name": "RDB_Concat_5_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_5_5", 0, 0, {}], ["F_5_6_Relu", 0, 0, {}]]]}, {"name": "LFF_5", "class_name": "Conv2D", "config": {"name": "LFF_5", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_5_6", 0, 0, {}]]]}, {"name": "LRL_5", "class_name": "Add", "config": {"name": "LRL_5", "trainable": true}, "inbound_nodes": [[["LFF_5", 0, 0, {}], ["LRL_4", 0, 0, {}]]]}, {"name": "F_6_1", "class_name": "Conv2D", "config": {"name": "F_6_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LRL_5", 0, 0, {}]]]}, {"name": "F_6_1_Relu", "class_name": "Activation", "config": {"name": "F_6_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_6_1", 0, 0, {}]]]}, {"name": "RDB_Concat_6_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_6_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["LRL_5", 0, 0, {}], ["F_6_1_Relu", 0, 0, {}]]]}, {"name": "F_6_2", "class_name": "Conv2D", "config": {"name": "F_6_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_6_1", 0, 0, {}]]]}, {"name": "F_6_2_Relu", "class_name": "Activation", "config": {"name": "F_6_2_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_6_2", 0, 0, {}]]]}, {"name": "RDB_Concat_6_2", "class_name": "Concatenate", "config": {"name": "RDB_Concat_6_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_6_1", 0, 0, {}], ["F_6_2_Relu", 0, 0, {}]]]}, {"name": "F_6_3", "class_name": "Conv2D", "config": {"name": "F_6_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_6_2", 0, 0, {}]]]}, {"name": "F_6_3_Relu", "class_name": "Activation", "config": {"name": "F_6_3_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_6_3", 0, 0, {}]]]}, {"name": "RDB_Concat_6_3", "class_name": "Concatenate", "config": {"name": "RDB_Concat_6_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_6_2", 0, 0, {}], ["F_6_3_Relu", 0, 0, {}]]]}, {"name": "F_6_4", "class_name": "Conv2D", "config": {"name": "F_6_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_6_3", 0, 0, {}]]]}, {"name": "F_6_4_Relu", "class_name": "Activation", "config": {"name": "F_6_4_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_6_4", 0, 0, {}]]]}, {"name": "RDB_Concat_6_4", "class_name": "Concatenate", "config": {"name": "RDB_Concat_6_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_6_3", 0, 0, {}], ["F_6_4_Relu", 0, 0, {}]]]}, {"name": "F_6_5", "class_name": "Conv2D", "config": {"name": "F_6_5", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_6_4", 0, 0, {}]]]}, {"name": "F_6_5_Relu", "class_name": "Activation", "config": {"name": "F_6_5_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_6_5", 0, 0, {}]]]}, {"name": "RDB_Concat_6_5", "class_name": "Concatenate", "config": {"name": "RDB_Concat_6_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_6_4", 0, 0, {}], ["F_6_5_Relu", 0, 0, {}]]]}, {"name": "F_6_6", "class_name": "Conv2D", "config": {"name": "F_6_6", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_6_5", 0, 0, {}]]]}, {"name": "F_6_6_Relu", "class_name": "Activation", "config": {"name": "F_6_6_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_6_6", 0, 0, {}]]]}, {"name": "RDB_Concat_6_6", "class_name": "Concatenate", "config": {"name": "RDB_Concat_6_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_6_5", 0, 0, {}], ["F_6_6_Relu", 0, 0, {}]]]}, {"name": "LFF_6", "class_name": "Conv2D", "config": {"name": "LFF_6", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_6_6", 0, 0, {}]]]}, {"name": "LRL_6", "class_name": "Add", "config": {"name": "LRL_6", "trainable": true}, "inbound_nodes": [[["LFF_6", 0, 0, {}], ["LRL_5", 0, 0, {}]]]}, {"name": "F_7_1", "class_name": "Conv2D", "config": {"name": "F_7_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LRL_6", 0, 0, {}]]]}, {"name": "F_7_1_Relu", "class_name": "Activation", "config": {"name": "F_7_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_7_1", 0, 0, {}]]]}, {"name": "RDB_Concat_7_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_7_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["LRL_6", 0, 0, {}], ["F_7_1_Relu", 0, 0, {}]]]}, {"name": "F_7_2", "class_name": "Conv2D", "config": {"name": "F_7_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_7_1", 0, 0, {}]]]}, {"name": "F_7_2_Relu", "class_name": "Activation", "config": {"name": "F_7_2_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_7_2", 0, 0, {}]]]}, {"name": "RDB_Concat_7_2", "class_name": "Concatenate", "config": {"name": "RDB_Concat_7_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_7_1", 0, 0, {}], ["F_7_2_Relu", 0, 0, {}]]]}, {"name": "F_7_3", "class_name": "Conv2D", "config": {"name": "F_7_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_7_2", 0, 0, {}]]]}, {"name": "F_7_3_Relu", "class_name": "Activation", "config": {"name": "F_7_3_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_7_3", 0, 0, {}]]]}, {"name": "RDB_Concat_7_3", "class_name": "Concatenate", "config": {"name": "RDB_Concat_7_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_7_2", 0, 0, {}], ["F_7_3_Relu", 0, 0, {}]]]}, {"name": "F_7_4", "class_name": "Conv2D", "config": {"name": "F_7_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_7_3", 0, 0, {}]]]}, {"name": "F_7_4_Relu", "class_name": "Activation", "config": {"name": "F_7_4_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_7_4", 0, 0, {}]]]}, {"name": "RDB_Concat_7_4", "class_name": "Concatenate", "config": {"name": "RDB_Concat_7_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_7_3", 0, 0, {}], ["F_7_4_Relu", 0, 0, {}]]]}, {"name": "F_7_5", "class_name": "Conv2D", "config": {"name": "F_7_5", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_7_4", 0, 0, {}]]]}, {"name": "F_7_5_Relu", "class_name": "Activation", "config": {"name": "F_7_5_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_7_5", 0, 0, {}]]]}, {"name": "RDB_Concat_7_5", "class_name": "Concatenate", "config": {"name": "RDB_Concat_7_5", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_7_4", 0, 0, {}], ["F_7_5_Relu", 0, 0, {}]]]}, {"name": "F_7_6", "class_name": "Conv2D", "config": {"name": "F_7_6", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_7_5", 0, 0, {}]]]}, {"name": "F_7_6_Relu", "class_name": "Activation", "config": {"name": "F_7_6_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_7_6", 0, 0, {}]]]}, {"name": "RDB_Concat_7_6", "class_name": "Concatenate", "config": {"name": "RDB_Concat_7_6", "trainable": true, "axis": 3}, "inbound_nodes": [[["RDB_Concat_7_5", 0, 0, {}], ["F_7_6_Relu", 0, 0, {}]]]}, {"name": "LFF_7", "class_name": "Conv2D", "config": {"name": "LFF_7", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["RDB_Concat_7_6", 0, 0, {}]]]}, {"name": "LRL_7", "class_name": "Add", "config": {"name": "LRL_7", "trainable": true}, "inbound_nodes": [[["LFF_7", 0, 0, {}], ["LRL_6", 0, 0, {}]]]}, {"name": "F_8_1", "class_name": "Conv2D", "config": {"name": "F_8_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LRL_7", 0, 0, {}]]]}, {"name": "F_8_1_Relu", "class_name": "Activation", "config": {"name": "F_8_1_Relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["F_8_1", 0, 0, {}]]]}, {"name": "RDB_Concat_8_1", "class_name": "Concatenate", "config": {"name": "RDB_Concat_8_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["LRL_7", 0, 0, {}], ["F_8_1_Relu", 0, 0, {}]]]}, {"name": "F_8_2", "class_name": "Conv2D", "config": {"name": "F_8_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", 